Web Services/1. Webservice Testing/Transactions/findTransactions/Test Case 8/WS_Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tran="http://www.hmco.com/EAI/OTS/Transaction">
   <soapenv:Header/>
   <soapenv:Body>
      <tran:transactionSearchCriteria>
       
<tran:limitOfResults>1</tran:limitOfResults>
         <tran:poNo>004225650</tran:poNo>
         
         
         
         <tran:partnerFunctionList>
            <!--1 or more repetitions:-->
           <tran:partnerFunction>PARTNER_FUNCTION_SHIPTO</tran:partnerFunction>
	<tran:partnerFunction>PARTNER_FUNCTION_BILLTO</tran:partnerFunction>
<tran:partnerFunction>PARTNER_FUNCTION_SOLDTO</tran:partnerFunction>
         </tran:partnerFunctionList>
      </tran:transactionSearchCriteria>
   </soapenv:Body>
</soapenv:Envelope>